# Задача №17. Решение в группах
# Дан список чисел. Определите, сколько в нем
# встречается различных чисел.
# Input: [1, 1, 2, 0, -1, 3, 4, 4]
# Output: 6

list1 =[1, 1, 2, 0, -1, 3, 4, 4]

list2 =set()
print(list2) 

for i in list1:
    list2.add(i)

print(len(list2))


   
